[
    {
      "id": 1,
      "type": "Mindfulness",
      "difficulty": 1,
      "activity": "Box Breathing",
      "goal": "Regulate the nervous system and clear mental fog using a rhythmic 4-count breathing pattern for five minutes.",
      "instructions": "**4-4-4-4 Cycle:** Inhale 4, Hold 4, Exhale 4, Pause 4. Repeat for 5 mins."
    },
    {
      "id": 2,
      "type": "Mindfulness",
      "difficulty": 1,
      "activity": "5-4-3-2-1 Grounding",
      "goal": "Quickly anchor your awareness to the present moment by noticing sensory details in your immediate environment.",
      "instructions": "Name: 5 things **see**, 4 things **feel**, 3 things **hear**, 2 things **smell**, 1 thing **taste**."
    },
    {
      "id": 3,
      "type": "Mindfulness",
      "difficulty": 1,
      "activity": "Mindful Tea/Coffee",
      "goal": "Transform a routine drink into a 5-minute meditation by focusing entirely on the sensory experience of heat, aroma, and taste.",
      "instructions": "Hold cup, inhale aroma 3x, take slow sips. Focus fully on the temperature, texture, and flavor for 5 minutes."
    },
    {
      "id": 4,
      "type": "Mindfulness",
      "difficulty": 1,
      "activity": "Body Scan (Feet)",
      "goal": "Ground yourself and practice non-judgmental awareness by focusing entirely on the physical sensations in your feet for five minutes.",
      "instructions": "Close eyes. Direct attention to feet (toes to ankles). Notice sensations (pressure, warmth, tingling) without judgment for 5 mins."
    },
    {
      "id": 5,
      "type": "Mindfulness",
      "difficulty": 1,
      "activity": "Mindful Appreciation",
      "goal": "Shift your focus to the present by observing an ordinary, nearby object for three minutes as if seeing it for the very first time.",
      "instructions": "Pick one ordinary object. Observe its color, shape, texture, and function for 3 mins, blocking thoughts about the future or past."
    },
    {
      "id": 6,
      "type": "Mindfulness",
      "difficulty": 2,
      "activity": "Conscious Listening",
      "goal": "Deepen concentration by committing full, undivided attention to the complex layers of an instrumental track for 3-5 minutes.",
      "instructions": "Listen to instrumental music (3-5 mins). Notice the instrument separation and melody. When the mind wanders, return focus to the sound."
    },
    {
      "id": 7,
      "type": "Mindfulness",
      "difficulty": 2,
      "activity": "Loving-Kindness (Maitri)",
      "goal": "Cultivate compassion and warm wishes for yourself and others by silently repeating specific well-wishing phrases for five minutes.",
      "instructions": "Silently repeat: \"May I be safe. May I be healthy. May I live with ease.\" Direct this first to yourself, then a loved one, then a neutral person. (5 mins)"
    },
    {
      "id": 8,
      "type": "Mindfulness",
      "difficulty": 2,
      "activity": "Mindful Washing",
      "goal": "Practice single-tasking by focusing all attention on the sensory experience of washing (hands or dishes) for 2 minutes.",
      "instructions": "Focus on the temperature and pressure of the water, the feel of the soap lather, and the scent until the task is complete."
    },
    {
      "id": 9,
      "type": "Mindfulness",
      "difficulty": 2,
      "activity": "Thought Stream Observation",
      "goal": "Develop detachment from thoughts by observing them for five minutes without judgment or engagement, treating them like passing clouds.",
      "instructions": "Sit quietly (5 mins). Observe thoughts as they arise. Do not judge or follow them; simply note their presence (\"There is a thought\") and let them pass."
    },
    {
      "id": 10,
      "type": "Mindfulness",
      "difficulty": 2,
      "activity": "Sense of Touch Focus",
      "goal": "Enhance sensory awareness by closing your eyes and spending two minutes exploring the subtle temperature, weight, and texture of three distinct objects.",
      "instructions": "Gather 3 objects (different textures). Close eyes. Spend 2 mins with each, feeling temperature, roughness, and subtle contours with your fingertips."
    },
    {
      "id": 11,
      "type": "Mindfulness",
      "difficulty": 3,
      "activity": "Open Awareness Meditation",
      "goal": "Practice non-reactive awareness by gently expanding your attention to encompass all internal and external stimuli for 7-10 minutes.",
      "instructions": "Sit 7-10 mins. Gently include all input: sounds, sensations, thoughts, and emotions. Allow everything to exist without focusing on one thing."
    },
    {
      "id": 12,
      "type": "Mindfulness",
      "difficulty": 3,
      "activity": "Gratitude Journaling",
      "goal": "Boost positive emotion and perspective by journaling three specific things you are grateful for and elaborating on the feelings they evoke (5 minutes).",
      "instructions": "Write 3 specific things you are grateful for. Elaborate on *why* and focus on feeling the associated positive emotion. (5 mins total)"
    },
    {
      "id": 13,
      "type": "Mindfulness",
      "difficulty": 3,
      "activity": "Acknowledging Difficulty",
      "goal": "Cultivate self-compassion by acknowledging a current difficult emotion or stressor for five minutes without trying to change or fix it.",
      "instructions": "Name one current stressor/emotion (e.g., anxiety). Place a hand on your heart/stomach. Breathe into the feeling for 5 mins, offering yourself compassion."
    },
    {
      "id": 14,
      "type": "Mindfulness",
      "difficulty": 3,
      "activity": "Visualizing a Safe Space",
      "goal": "Use a 7-minute mental retreat to construct and explore a peaceful, safe place in vivid detail to induce calm and emotional security.",
      "instructions": "Close eyes. Mentally construct a safe place (light, scents, temperature, sounds). Spend 7 minutes exploring this vivid space."
    },
    {
      "id": 15,
      "type": "Mindfulness",
      "difficulty": 3,
      "activity": "Single-Task Focus (Writing)",
      "goal": "Sharpen focus and productivity by committing to only one non-urgent writing task for ten minutes, actively blocking all digital distractions.",
      "instructions": "Choose one task (email/list). Commit 10 mins without checking phone/tabs. If attention shifts, physically return to the task immediately."
    },
    {
      "id": 16,
      "type": "Mobility",
      "difficulty": 1,
      "activity": "Seated Spinal Twist",
      "goal": "Relieve stiffness and increase range of motion in the mid-back (thoracic spine) with a gentle seated twist.",
      "instructions": "1. Sit tall on a chair. 2. Place right hand on chair back, left hand on right thigh. 3. Gently twist right, looking over shoulder. 4. Hold 30 seconds, breathe deeply. 5. Repeat on the left side. 6. Complete 2 rounds per side."
    },
    {
      "id": 17,
      "type": "Mobility",
      "difficulty": 1,
      "activity": "Ankle and Wrist Circles",
      "goal": "Improve circulation and lubricate the joints in the ankles and wrists, which are often stagnant during prolonged sitting.",
      "instructions": "1. While seated, lift one foot. 2. Rotate ankle 10x CW, 10x CCW. 3. Flex/point foot 10x. 4. Repeat on other foot. 5. Simultaneously, clasp hands and rotate wrists 10x in both directions."
    },
    {
      "id": 18,
      "type": "Mobility",
      "difficulty": 1,
      "activity": "Doorway Pec Stretch",
      "goal": "Counteract rounded shoulders from desk work by stretching the chest and anterior shoulder muscles using a doorway.",
      "instructions": "1. Stand in a doorway. 2. Place forearms on the frame, elbows bent 90 degrees. 3. Step one foot forward until you feel a gentle chest stretch. 4. Hold for 30-45 seconds, keeping the lower back neutral. 5. Repeat the stretch 2 times."
    },
    {
      "id": 19,
      "type": "Mobility",
      "difficulty": 1,
      "activity": "Neck and Scalene Stretch",
      "goal": "Relieve tension headaches and stiffness by stretching the sides and back of the neck muscles (scalenes and upper traps).",
      "instructions": "1. Sit upright. 2. Drop right ear toward right shoulder (hold 20s). 3. Repeat left side. 4. Tuck chin, look down toward armpit (hold 20s). 5. Repeat on the other side."
    },
    {
      "id": 20,
      "type": "Mobility",
      "difficulty": 1,
      "activity": "Cat-Cow (Seated)",
      "goal": "Mobilize the entire spine and pelvis with a seated variation of Cat-Cow, coordinating the movement with deep, slow breaths for five minutes.",
      "instructions": "1. Sit on chair edge, hands on knees. 2. **Cat:** Round spine, tuck chin. 3. **Cow:** Arch back, squeeze shoulder blades, lift chin. 4. Slowly flow between Cat and Cow for 5 minutes, matching movement to your breath."
    },
    {
      "id": 21,
      "type": "Mobility",
      "difficulty": 2,
      "activity": "Thoracic Spine Rotation",
      "goal": "Improve rotational mobility in the mid-back and reduce stiffness often caused by sustained forward posture.",
      "instructions": "1. Lie on left side, knees bent 90 degrees. 2. Arms straight out. 3. Slowly lift right arm, rotating torso to open arm toward the floor behind you. 4. Follow hand with eyes. 5. Return to start. Repeat 8 times per side."
    },
    {
      "id": 22,
      "type": "Mobility",
      "difficulty": 2,
      "activity": "Quad/Hip Flexor Lunge",
      "goal": "Release tight hip flexors and quadriceps, which are critical areas for pain relief and posture, especially for long periods of sitting.",
      "instructions": "1. Kneel on left knee, right foot forward (90° bend). 2. Tuck pelvis slightly (squeeze left glute). 3. Gently lean torso forward to feel stretch in the front of the left hip. 4. Hold for 45 seconds per side."
    },
    {
      "id": 23,
      "type": "Mobility",
      "difficulty": 2,
      "activity": "Controlled Squat-to-Stand",
      "goal": "Reinforce fundamental lower body strength and hip hinge mechanics with 10-15 slow, controlled repetitions.",
      "instructions": "1. Stand feet shoulder-width apart. 2. Push hips back/down (as if sitting). Keep chest up, weight in heels. 3. Slowly stand up, squeezing glutes at the top. 4. Perform 10-15 slow, controlled repetitions."
    },
    {
      "id": 24,
      "type": "Mobility",
      "difficulty": 2,
      "activity": "Shoulder Blade Squeezes",
      "goal": "Activate and strengthen the muscles between the shoulder blades to improve upright posture and combat slouching.",
      "instructions": "1. Stand or sit tall, arms relaxed. 2. Slowly squeeze shoulder blades together (like holding a pencil). 3. Hold squeeze for 5 seconds. 4. Relax and repeat 10 times."
    },
    {
      "id": 25,
      "type": "Mobility",
      "difficulty": 2,
      "activity": "Figure-Four Stretch (Seated)",
      "goal": "Relieve tightness in the glutes and outer hips, which often contribute to lower back pain.",
      "instructions": "1. Sit tall on a chair. 2. Cross right ankle over left knee. 3. Keep back straight. 4. Gently hinge forward at the hips until a stretch is felt in the right glute. 5. Hold for 45 seconds per side."
    },
    {
      "id": 26,
      "type": "Mobility",
      "difficulty": 3,
      "activity": "Dynamic Hip Circles",
      "goal": "Improve active range of motion, stability, and control within the hip joint capsule without compensating with the lower back.",
      "instructions": "1. Stand next to a wall for balance. 2. Slowly lift your right knee. 3. Trace a large, slow circle with the knee (10x CW, 10x CCW). 4. Focus on movement through the hip socket; keep torso still. 5. Repeat on the left leg."
    },
    {
      "id": 27,
      "type": "Mobility",
      "difficulty": 3,
      "activity": "Overhead Wall Slides",
      "goal": "Restore proper shoulder and upper back mechanics by reinforcing correct movement patterns against the resistance of the wall.",
      "instructions": "1. Stand with back against a wall, lower back flat. 2. Place arms on wall, elbows 90 degrees (palms forward). 3. Slowly slide arms straight up the wall. 4. **Crucial:** Stop if lower back arches. 5. Slide back down. Repeat 10-15 times."
    },
    {
      "id": 28,
      "type": "Mobility",
      "difficulty": 3,
      "activity": "Gate Pose Side Bend Flow",
      "goal": "Improve lateral flexion (side bending) mobility in the spine and stretch the intercostal muscles along the side of the rib cage.",
      "instructions": "1. Stand feet wide, turn right foot out 90°. 2. Lean torso right (right hand to thigh/shin). 3. Extend left arm overhead. 4. Gently flow between a deep side bend and slightly upright (8x per side)."
    },
    {
      "id": 29,
      "type": "Mobility",
      "difficulty": 3,
      "activity": "Hamstring and Calf Dynamic Stretch",
      "goal": "Dynamically lengthen the hamstring and calf complex to improve flexibility and prepare the muscles for movement.",
      "instructions": "1. Stand, place one heel on a low step/curb (leg straight). 2. Tuck chin, reach hands toward toes. 3. Hold stretch for 5 seconds. 4. Stand up and repeat 8 times per leg. (Controlled movement is key)."
    },
    {
      "id": 30,
      "type": "Mobility",
      "difficulty": 3,
      "activity": "World’s Greatest Stretch (Modified)",
      "goal": "A multi-joint movement to open the hips, thoracic spine, and hip flexors simultaneously, enhancing whole-body coordination and mobility.",
      "instructions": "1. Start in high plank. 2. Step right foot outside right hand (hold 10s). 3. Lift right arm to ceiling, twisting chest open (hold 10s). 4. Return to plank. 5. Repeat with left foot. 6. Complete 3 rounds per side."
    }
  ]